import React from 'react';
import Svg, { Path } from 'react-native-svg';

const Loop = ({ color = 'black', size = 30 }) => {
  const width = size;
  const height = size / 2; // En boy oranını korumak için yüksekliği yarıya indiriyoruz

  return (
    <Svg
      width={width}
      height={height}
      viewBox="0 0 30 15"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
    >
      <Path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M2.05452 2.05452C4.79388 -0.68484 9.23526 -0.68484 11.9746 2.05452L15.957 6.03689L16.9347 7.01457L15.957 7.99225L11.9746 11.9746C9.23526 14.714 4.79388 14.714 2.05452 11.9746C-0.68484 9.23526 -0.68484 4.79388 2.05452 2.05452ZM10.0193 4.00987C8.35982 2.35043 5.66932 2.35043 4.00987 4.00987C2.35043 5.66932 2.35043 8.35982 4.00987 10.0193C5.66932 11.6787 8.35982 11.6787 10.0193 10.0193L13.024 7.01457L10.0193 4.00987Z"
        fill={color}
      />
      <Path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M27.8735 12.0109C25.1341 14.7502 20.6928 14.7502 17.9534 12.0109L13.971 8.0285L12.9933 7.05083L13.971 6.07315L17.9534 2.09078C20.6928 -0.648585 25.1341 -0.648585 27.8735 2.09078C30.6129 4.83014 30.6129 9.27151 27.8735 12.0109ZM19.9088 10.0555C21.5682 11.715 24.2587 11.715 25.9181 10.0555C27.5776 8.39607 27.5776 5.70558 25.9181 4.04613C24.2587 2.38668 21.5682 2.38668 19.9088 4.04613L16.9041 7.05083L19.9088 10.0555Z"
        fill={color}
      />
    </Svg>
  );
};

export default Loop;
